codelingo/troubleshooting/tenets/well-named-locks.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-11-02 Fri 19:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>troubleshooting new tenet <code>well-named-locks</code></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="shane" />
<link rel="stylesheet" type="text/css" href="https://mullikine.github.io/org-main.css"/>
<link rel="stylesheet" type="text/css" href="https://mullikine.github.io/magit.css"/>
</head>
<body>
<div id="content">
<h1 class="title">troubleshooting new tenet <code>well-named-locks</code></h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0c8109d">1. Problem</a>
<ul>
<li><a href="#org4108141">1.1. <code>example.go</code></a></li>
<li><a href="#orgf74d466">1.2. This <code>codelingo.yaml</code> fails</a></li>
<li><a href="#org188ed2e">1.3. annotated <code>tty-output.log</code></a></li>
<li><a href="#org8742344">1.4. repository info</a></li>
<li><a href="#org2482201">1.5. https://github.com/codelingo/codelingo/blob/master</a></li>
<li><a href="#org29862d1">1.6. git@github.com:mullikine/lingo.git/blob/master</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org0c8109d" class="outline-2">
<h2 id="org0c8109d"><span class="section-number-2">1</span> Problem</h2>
<div class="outline-text-2" id="text-1">
<p>
<code>lockA sync.Mutex</code> should be detected here as a bad lock name. Not sure how to write a query to match this.
</p>

<p>
Might need to combine with an <code>any_of:</code>.
</p>

<p>
Not going to proceed until <code>any_of:</code> bug is fixed.
</p>
</div>

<div id="outline-container-org4108141" class="outline-3">
<h3 id="org4108141"><span class="section-number-3">1.1</span> <code>example.go</code></h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-go"><span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">./example.go</span>
<span style="color: #a1db00;">package</span> main

<span style="color: #a1db00;">import</span> <span style="color: #ff4ea3;">"fmt"</span>

<span style="color: #a1db00;">type</span> <span style="color: #00d7af;">anyStruct</span> <span style="color: #a1db00;">struct</span> {
    lock sync.Mutex
}

<span style="color: #a1db00;">type</span> <span style="color: #00d7af;">bStruct</span> <span style="color: #a1db00;">struct</span> {
    bLock sync.Mutex
}

<span style="color: #a1db00;">type</span> <span style="color: #00d7af;">MockAddresses</span> <span style="color: #a1db00;">struct</span> {
    lockA sync.Mutex
    bLock sync.Mutex
    lockC sync.Mutex
}

<span style="color: #a1db00;">type</span> <span style="color: #00d7af;">AllGoodLocks</span> <span style="color: #a1db00;">struct</span> {
    stateLock sync.Mutex
    stateBLock sync.Mutex
    anotherLock sync.Mutex
}

<span style="color: #a1db00;">type</span> <span style="color: #00d7af;">BadLocks</span> <span style="color: #a1db00;">struct</span> {
    lock sync.Mutex
    badlock sync.Mutex
    badlockC sync.Mutex
}

</pre>
</div>
</div>
</div>

<div id="outline-container-orgf74d466" class="outline-3">
<h3 id="orgf74d466"><span class="section-number-3">1.2</span> This <code>codelingo.yaml</code> fails</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #ff8700;">funcs</span>:
  - <span style="color: #ff8700;">name</span>: isInvalidLockName
    <span style="color: #ff8700;">type</span>: asserter
    <span style="color: #ff8700;">body</span>: |
      <span style="color: #ff4ea3;">function (a) {</span>
<span style="color: #ff4ea3;">        return a.match(/^[a-z]+([A-Z][a-z]*)*Lock$/) === null</span>
<span style="color: #ff4ea3;">      }</span>
tenets:
  - <span style="color: #ff8700;">name</span>: well-named-locks
    <span style="color: #ff8700;">flows</span>:
      <span style="color: #ff8700;">codelingo/docs</span>:
        <span style="color: #ff8700;">title</span>: Well Named Locks
        <span style="color: #ff8700;">body</span>: |
          <span style="color: #ff4ea3;">Locks should be called `lock` and should never be embedded </span>
<span style="color: #ff4ea3;">          (always `lock sync.Mutex`). When multiple locks are present, </span>
<span style="color: #ff4ea3;">          give each lock a distinct name following Go conventions </span>
<span style="color: #ff4ea3;">          - `stateLock`, `mapLock` etc.</span>
      <span style="color: #ff8700;">codelingo/review</span>:
        <span style="color: #ff8700;">comment</span>: Mutex {{lockname}} is named unconventionally. When multiple locks are present, give each lock a distinct name following Go conventions - `stateLock`, `mapLock` etc.
    <span style="color: #ff8700;">query</span>: |
      <span style="color: #ff4ea3;">import codelingo/ast/go</span>

<span style="color: #ff4ea3;">      go.file(depth = any):</span>
<span style="color: #ff4ea3;">        go.decls:</span>
<span style="color: #ff4ea3;">          go.gen_decl:</span>
<span style="color: #ff4ea3;">            go.type_spec:</span>
<span style="color: #ff4ea3;">              go.struct_type:</span>
<span style="color: #ff4ea3;">                go.field_list:</span>
<span style="color: #ff4ea3;">                  go.field:</span>
<span style="color: #ff4ea3;">                    go.names:</span>
<span style="color: #ff4ea3;">                      go.ident</span>
<span style="color: #ff4ea3;">                    go.selector_expr:</span>
<span style="color: #ff4ea3;">                      go.ident:</span>
                        name == <span style="color: #ff4ea3;">"sync"</span>
<span style="color: #ff4ea3;">                      go.ident:</span>
                        name == <span style="color: #ff4ea3;">"Mutex"</span>
<span style="color: #ff4ea3;">                  go.field:</span>
<span style="color: #ff4ea3;">                    go.names:</span>
<span style="color: #ff4ea3;">                      @review comment</span>
<span style="color: #ff4ea3;">                      go.ident:</span>
<span style="color: #ff4ea3;">                        name as lockname</span>
<span style="color: #ff4ea3;">                        isInvalidLockName(lockname)</span>
<span style="color: #ff4ea3;">                    go.selector_expr:</span>
<span style="color: #ff4ea3;">                      go.ident:</span>
                        name == <span style="color: #ff4ea3;">"sync"</span>
<span style="color: #ff4ea3;">                      go.ident:</span>
                        name == <span style="color: #ff4ea3;">"Mutex"</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org188ed2e" class="outline-3">
<h3 id="org188ed2e"><span class="section-number-3">1.3</span> annotated <code>tty-output.log</code></h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-text">Constructing new git repo in temp folder... :: Thu Nov  1 14:54:42 NZDT 2018
&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;
Running: $HOME/scripts/rs -nc
        -nogit
        -noswap
        $HOME/source/git/Daanikus/tenets/k8s/well-named-locks/
        /tmp/td_well-named-lockszalIwI
/usr/bin/rsync  -a -rtlhx -pug -s  --inplace --append   --exclude .cache  --exclude .git/ --exclude .gitignore --exclude TODO  --exclude '*~' --exclude '.#*'  $HOME/source/git/Daanikus/tenets/k8s/well-named-locks/ /tmp/td_well-named-lockszalIwI
&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;
/tmp/td_well-named-lockszalIwI
working_dir (initial): /tmp/td_well-named-lockszalIwI
Syncing your repo...
Running review flow...
example.go:27:12
    Mutex badlock is named unconventionally. When multiple locks are present, give each lock a distinct name following Go conventions - `stateLock`, `mapLock` etc.
    ...
    type BadLocks struct {
        lock sync.Mutex
  +     badlock sync.Mutex
        badlockC sync.Mutex
    }
    ...
[o]pen [k]eep [d]iscard : k
example.go:28:13
    Mutex badlockC is named unconventionally. When multiple locks are present, give each lock a distinct name following Go conventions - `stateLock`, `mapLock` etc.
    ...
        lock sync.Mutex
        badlock sync.Mutex
  +     badlockC sync.Mutex
    }
    ...
[o]pen [k]eep [d]iscard : k
example.go:26:9
    Mutex lock is named unconventionally. When multiple locks are present, give each lock a distinct name following Go conventions - `stateLock`, `mapLock` etc.
    ...
    type BadLocks struct {
  +     lock sync.Mutex
        badlock sync.Mutex
        badlockC sync.Mutex
    ...
[o]pen [k]eep [d]iscard : k
example.go:16:10
    Mutex lockC is named unconventionally. When multiple locks are present, give each lock a distinct name following Go conventions - `stateLock`, `mapLock` etc.
    ...
        lockA sync.Mutex
        bLock sync.Mutex
  +     lockC sync.Mutex
    }
    ...
[o]pen [k]eep [d]iscard : k
Done! 4 issues found.
: B
working_dir: /tmp/td_well-named-lockszalIwI
Continue?
</pre>
</div>
</div>
</div>

<div id="outline-container-org8742344" class="outline-3">
<h3 id="org8742344"><span class="section-number-3">1.4</span> repository info</h3>
<div class="outline-text-3" id="text-1-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">tenet source</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="https://github.com/mullikine/tenets/blob/master/blog/well-named-locks">tenets/blog/well-named-locks at master  mullikine/tenets  GitHub</a></td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">org</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="https://github.com/mullikine/mullikine.github.io/blob/master/codelingo/troubleshooting/tenets/well-named-locks.org">github.com/mullikine/mullikine.github.io/blob/master/codelingo/troubleshooting/tenets/well-named-locks.org</a></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org2482201" class="outline-3">
<h3 id="org2482201"><span class="section-number-3">1.5</span> <a href="https://github.com/codelingo/codelingo/blob/master">https://github.com/codelingo/codelingo/blob/master</a></h3>
<div class="outline-text-3" id="text-1-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">command</th>
<th scope="col" class="org-left">value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">cat /etc/issue</td>
<td class="org-left">Ubuntu 16.04.4 LTS \n \l</td>
</tr>

<tr>
<td class="org-left">vc url</td>
<td class="org-left"><a href="https://github.com/codelingo/codelingo">https://github.com/codelingo/codelingo</a></td>
</tr>

<tr>
<td class="org-left">vc get-hash</td>
<td class="org-left">eae3300ad7c32994725f90344f7cc25edfee6eca</td>
</tr>

<tr>
<td class="org-left">vc branch</td>
<td class="org-left">master</td>
</tr>

<tr>
<td class="org-left">go version</td>
<td class="org-left">go version go1.11.1 linux/amd64</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-text">commit eae3300ad7c32994725f90344f7cc25edfee6eca
Author: Jesse Meek <a href="mailto:waigani%40gmail.com">&lt;waigani@gmail.com&gt;</a>
Date:   Sat Oct 27 10:37:36 2018 +1300

    Disable test Tenet until mem spike is fixed.
</pre>
</div>
</div>
</div>

<div id="outline-container-org29862d1" class="outline-3">
<h3 id="org29862d1"><span class="section-number-3">1.6</span> git@github.com:mullikine/lingo.git/blob/master</h3>
<div class="outline-text-3" id="text-1-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">command</th>
<th scope="col" class="org-left">value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">cat /etc/issue</td>
<td class="org-left">Ubuntu 16.04.4 LTS \n \l</td>
</tr>

<tr>
<td class="org-left">vc url</td>
<td class="org-left">git@github.com:mullikine/lingo.git</td>
</tr>

<tr>
<td class="org-left">vc get-hash</td>
<td class="org-left">fa9b4edd1dcad69f83892282d69877ab51f4e89c</td>
</tr>

<tr>
<td class="org-left">vc branch</td>
<td class="org-left">master</td>
</tr>

<tr>
<td class="org-left">go version</td>
<td class="org-left">go version go1.11.1 linux/amd64</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-text">commit fa9b4edd1dcad69f83892282d69877ab51f4e89c
Merge: f34abad d1910ac
Author: BlakeMScurr <a href="mailto:blake%40codelingo.io">&lt;blake@codelingo.io&gt;</a>
Date:   Wed Oct 17 17:45:51 2018 +1300

    Merge pull request #424 from BlakeMScurr/docs-update
    
    Update doc fields.
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: shane</p>
<p class="date">Created: 2018-11-02 Fri 19:53</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>